#define _CRT_SECURE_NO_WARNINGS   1
#include<stdio.h>
int main()
{
	char a = -1;                              //10000000 00000000 00000000 000000001  -1的原码
	signed char b = -1;                       //11111111 11111111 11111111 111111110  -1的反码
	unsigned char c = -1;                     //11111111 11111111 11111111 111111111  -1的补码
	printf("a=%d,b=%d,c=%d", a, b, c);        //因为a是字符类型，所以发生截断 111111111
	return 0;                                 //%d打印十进制，所以发生整形提升，按符号位来提升
}                                             //11111111 11111111 11111111 11111111  -1的补码，所以原码为-1
                                              //对于unsigned char来说      11111111 中1不是符号位所以高位补0
                                              //00000000 00000000 00000000 11111111 所以为正数，原、反、补相同为255

int main()
{
	char a = -128;                           //10000000 00000000 00000000 10000000  128的原码
	printf("%u\n", a);                       //11111111 11111111 11111111 01111111  128的反码
}                                            //11111111 11111111 11111111 10000000  128的补码
                                             //因为a是字符类型,所以发生截断 10000000 a的值
                                             //%u是打印无符号整形,所以发成整形提升
                                             //11111111 11111111 11111111 10000000
                                             //%u是无符号整形，所以原码、反码、补码相同



int main()
{
	char a = 128;                           //00000000 00000000 00000000 10000000  128的原码 
	printf("%u\n", a);                      //01111111 11111111 11111111 01111111  128的反码
}                                           //01111111 11111111 11111111 10000000  128的补码
                                            //因为a是char类型，所以发生截断 10000000 -a
                                            //%u是打印无符号整形,所以发生整形提升,因为是char类型,所以高位是符号位
                                            //11111111 11111111 11111111 100000000 
                                            //%u是无符号整形，所以原码、反码、补码相同


int main()
{
	int i = -20;                            //10000000 00000000 00000000 00010100  -20的原码
	unsigned int j = 10;                    //11111111 11111111 11111111 11101011  -20的反码
	printf("%d\n", i + j);                  //11111111 11111111 11111111 11101100  -20的补码
}                                           //00000000 00000000 00000000 00001010  10的原码、反码、补码
                                            //11111111 11111111 11111111 11110110  相加为补码
                                            //11111111 11111111 11111111 11110101   反码
                                            //10000000 00000000 00000000 00001010   补码  为-10

